STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit callbacks */
    if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_MSPINIT_CB_ID, SAI_MspInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_MSPDEINIT_CB_ID, SAI_MspDeInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      Audio_Out_Ctx[Instance].IsMspCallbacksValid = 1U;
    }
  }
  /* Return BSP status */
  return status;
}

/**
  * @brief  Register BSP AUDIO OUT msp callbacks.
  * @param  Instance AUDIO OUT Instance.
  * @param  CallBacks Pointer to MspInit/MspDeInit callback functions.
  * @retval BSP status
  */
int32_t BSP_AUDIO_OUT_RegisterMspCallbacks(uint32_t Instance, BSP_AUDIO_OUT_Cb_t *CallBacks)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit callbacks */
    if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_MSPINIT_CB_ID, CallBacks->pMspSaiInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_MSPDEINIT_CB_ID, CallBacks->pMspSaiDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      Audio_Out_Ctx[Instance].IsMspCallbacksValid = 1U;
    }
  }
  /* Return BSP status */
  return status;
}
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Manage the BSP audio out transfer complete event.
  * @param  Instance Audio out instance.
  * @retval None.
  */
__weak void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief  Manage the BSP audio out half transfer complete event.
  * @param  Instance Audio out instance.
  * @retval None.
  */
__weak void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief  Manages the BSP audio out error event.
  * @param  Instance Audio out instance.
  * @retval None.
  */
__weak void BSP_AUDIO_OUT_Error_CallBack(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief  SAI1 clock Config.
  * @param  hsai SAI handle.
  * @param  SampleRate Audio sample rate used to play the audio stream.
  * @note   The SAI PLL configuration done within this function assumes that
  *         the SAI PLL input is HSE clock and that HSE is already enabled at 32 MHz.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_SAI1_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t SampleRate)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  HAL_StatusTypeDef ret = HAL_OK;
  RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;
  RCC_OscInitTypeDef       rcc_osc_init_struct;

  rcc_osc_init_struct.OscillatorType      = RCC_OSCILLATORTYPE_HSE;
  rcc_osc_init_struct.HSEState            = RCC_HSE_ON;
  rcc_osc_init_struct.HSEDiv              = RCC_HSE_DIV1;
  rcc_osc_init_struct.PLL1.PLLState       = RCC_PLL_ON;
  rcc_osc_init_struct.PLL1.PLLSource      = RCC_PLLSOURCE_HSE;
  rcc_osc_init_struct.PLL1.PLLM           = 8;
  if ((SampleRate == AUDIO_FREQUENCY_11K) || (SampleRate == AUDIO_FREQUENCY_22K) || (SampleRate == AUDIO_FREQUENCY_44K))
  {
    /* SAI clock config:
    PLL1_VCO Input = HSE/PLLM = 4 Mhz
    PLL1_VCO Output = PLL1_VCO Input * PLLN = 192 Mhz
    SAI_CLK_x = PLL1_VCO Output/PLLP = 192/17 = 11.294 Mhz */
    rcc_osc_init_struct.PLL1.PLLN         = 48;
    rcc_osc_init_struct.PLL1.PLLP         = 17;
  }
  else  /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K */
  {
    /* SAI clock config:
    PLL1_VCO Input = HSE/PLLM = 4 Mhz
    PLL1_VCO Output = PLL1_VCO Input * PLLN = 344 Mhz
    SAI_CLK_x = PLL1_VCO Output/PLLP = 344/7 = 49.142 Mhz */
    rcc_osc_init_struct.PLL1.PLLN         = 86;
    rcc_osc_init_struct.PLL1.PLLP         = 7;
  }
  rcc_osc_init_struct.PLL1.PLLQ           = 28;
  rcc_osc_init_struct.PLL1.PLLR           = 28;
  rcc_osc_init_struct.PLL1.PLLFractional  = 0;
  if (HAL_RCC_OscConfig(&rcc_osc_init_struct) != HAL_OK)
  {
    ret = HAL_ERROR;
  }

  rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  rcc_ex_clk_init_struct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL1P;

  if (HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct) != HAL_OK)
  {
    ret = HAL_ERROR;
  }

  __HAL_RCC_SAI1_CLK_ENABLE();

  return ret;
}

/**
  * @brief  Initialize SAI1.
  * @param  hsai SAI handle.
  * @param  MXInit SAI configuration structure.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_SAI1_Init(SAI_HandleTypeDef *hsai, MX_SAI_Config_t *MXInit)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hsai->Instance == AUDIO_IN_SAI_PDM) && (Audio_In_Ctx[1U].State != AUDIO_IN_STATE_RESET))
  {
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(hsai);

    /* Configure SAI1_Block_A */
    hsai->Init.MonoStereoMode       = MXInit->MonoStereoMode;
    hsai->Init.AudioFrequency       = SAI_AUDIO_FREQUENCY_MCKDIV;
    hsai->Init.AudioMode            = MXInit->AudioMode;
    hsai->Init.NoDivider            = SAI_MASTERDIVIDER_DISABLE;
    hsai->Init.Protocol             = SAI_FREE_PROTOCOL;
    hsai->Init.DataSize             = MXInit->DataSize;
    hsai->Init.FirstBit             = SAI_FIRSTBIT_LSB;
    hsai->Init.ClockStrobing        = MXInit->ClockStrobing;
    hsai->Init.Synchro              = MXInit->Synchro;
    hsai->Init.OutputDrive          = MXInit->OutputDrive;
    hsai->Init.FIFOThreshold        = SAI_FIFOTHRESHOLD_1QF;
    hsai->Init.SynchroExt           = MXInit->SynchroExt;
    hsai->Init.CompandingMode       = SAI_NOCOMPANDING;
    hsai->Init.TriState             = SAI_OUTPUT_NOTRELEASED;
    /* Set Mckdiv according sample rate */
    if ((MXInit->AudioFrequency == AUDIO_FREQUENCY_8K) || (MXInit->AudioFrequency == AUDIO_FREQUENCY_16K) ||
        (MXInit->AudioFrequency == AUDIO_FREQUENCY_32K))
    {
      /* Set PDM clock to 1024KHz so Mckdiv to 24 (Fsai/(Fpdm*2)) */
      hsai->Init.Mckdiv = 24U;
    }
    else if ((MXInit->AudioFrequency == AUDIO_FREQUENCY_48K) || (MXInit->AudioFrequency == AUDIO_FREQUENCY_96K) ||
             (MXInit->AudioFrequency == AUDIO_FREQUENCY_192K))
    {
      /* Set PDM clock to 3072KHz so Mckdiv to 8 (Fsai/(Fpdm*2)) */
      hsai->Init.Mckdiv = 8U;
    }
    else if ((MXInit->AudioFrequency == AUDIO_FREQUENCY_11K) || (MXInit->AudioFrequency == AUDIO_FREQUENCY_22K) ||
             (MXInit->AudioFrequency == AUDIO_FREQUENCY_44K))
    {
      /* Set PDM clock to 1411,2KHz so Mckdiv to 4 (Fsai/(Fpdm*2)) */
      hsai->Init.Mckdiv = 4U;
    }
    else /* AUDIO_FREQUENCY_88K or AUDIO_FREQUENCY_196K */
    {
      /* Set PDM clock to 2822,4KHz so Mckdiv to 2 (Fsai/(Fpdm*2)) */
      hsai->Init.Mckdiv = 2U;
    }
    hsai->Init.MckOutput            = SAI_MCK_OUTPUT_ENABLE;
    hsai->Init.MckOverSampling      = SAI_MCK_OVERSAMPLING_DISABLE;
    hsai->Init.PdmInit.Activation   = ENABLE;
    hsai->Init.PdmInit.MicPairsNbr  = 1;
    hsai->Init.PdmInit.ClockEnable  = SAI_PDM_CLOCK1_ENABLE;

    /* Configure SAI1_Block_A Frame */
    hsai->FrameInit.FrameLength       = MXInit->FrameLength;
    hsai->FrameInit.ActiveFrameLength = MXInit->ActiveFrameLength;
    hsai->FrameInit.FSDefinition      = SAI_FS_STARTFRAME;
    hsai->FrameInit.FSPolarity        = SAI_FS_ACTIVE_HIGH;
    hsai->FrameInit.FSOffset          = SAI_FS_FIRSTBIT;

    /* Configure SAI1_Block_A Slot */
    hsai->SlotInit.FirstBitOffset     = 0;
    hsai->SlotInit.SlotSize           = SAI_SLOTSIZE_DATASIZE;
    hsai->SlotInit.SlotNumber         = 2;
    hsai->SlotInit.SlotActive         = MXInit->SlotActive;

    if (HAL_SAI_Init(hsai) != HAL_OK)
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(hsai);

    /* Configure SAI1_Block_X */
    hsai->Init.MonoStereoMode       = MXInit->MonoStereoMode;
    hsai->Init.AudioFrequency       = MXInit->AudioFrequency;
    hsai->Init.AudioMode            = MXInit->AudioMode;
    hsai->Init.NoDivider            = SAI_MASTERDIVIDER_ENABLE;
    hsai->Init.Protocol             = SAI_FREE_PROTOCOL;
    hsai->Init.DataSize             = MXInit->DataSize;
    hsai->Init.FirstBit             = SAI_FIRSTBIT_MSB;
    hsai->Init.ClockStrobing        = MXInit->ClockStrobing;
    hsai->Init.Synchro              = MXInit->Synchro;
    hsai->Init.OutputDrive          = MXInit->OutputDrive;
    hsai->Init.FIFOThreshold        = SAI_FIFOTHRESHOLD_1QF;
    hsai->Init.SynchroExt           = MXInit->SynchroExt;
    hsai->Init.CompandingMode       = SAI_NOCOMPANDING;
    hsai->Init.TriState             = SAI_OUTPUT_NOTRELEASED;
    hsai->Init.Mckdiv               = 0U;
    hsai->Init.MckOutput            = SAI_MCK_OUTPUT_ENABLE;
    hsai->Init.MckOverSampling      = SAI_MCK_OVERSAMPLING_DISABLE;
    hsai->Init.PdmInit.Activation   = DISABLE;

    /* Configure SAI1_Block_X Frame */
    hsai->FrameInit.FrameLength       = MXInit->FrameLength;
    hsai->FrameInit.ActiveFrameLength = MXInit->ActiveFrameLength;
    hsai->FrameInit.FSDefinition      = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai->FrameInit.FSPolarity        = SAI_FS_ACTIVE_LOW;
    hsai->FrameInit.FSOffset          = SAI_FS_BEFOREFIRSTBIT;

