STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
          /* Prepare haudio_in_sai handle */
          mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
          mx_config.AudioMode             = SAI_MODESLAVE_RX;
          mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
          mx_config.MonoStereoMode        = (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? SAI_MONOMODE :
                                            SAI_STEREOMODE;
          mx_config.DataSize              = SAI_DATASIZE_16;
          mx_config.FrameLength           = 32;
          mx_config.ActiveFrameLength     = 16;
          mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
          mx_config.Synchro               = SAI_SYNCHRONOUS;
          mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
          mx_config.SlotActive            = (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? SAI_SLOTACTIVE_0 :
                                            (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1);

          if (MX_SAI1_Init(&haudio_in_sai, &mx_config) != HAL_OK)
          {
            /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              /* Prepare haudio_out_sai handle */
              mx_config.AudioMode         = SAI_MODEMASTER_TX;
              mx_config.Synchro           = SAI_ASYNCHRONOUS;
              mx_config.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

              Audio_Out_Ctx[0].BitsPerSample = AUDIO_RESOLUTION_16B;

              if (MX_SAI1_Init(&haudio_out_sai, &mx_config) != HAL_OK)
              {
                /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
          if (ret == BSP_ERROR_NONE)
          {
            /* Register SAI TC, HT and Error callbacks */
            if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback)
                     != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
          if (ret == BSP_ERROR_NONE)
          {
            CS42L51_Init_t codec_init;

            /* Fill codec_init structure */
            codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) ? CS42L51_OUT_NONE :
                                      CS42L51_OUT_HEADPHONE;
            codec_init.Frequency    = AudioInit->SampleRate;
            codec_init.Resolution   = CS42L51_RESOLUTION_16B; /* Not used */
            codec_init.Volume       = AudioInit->Volume;
            codec_init.InputDevice  = (AudioInit->Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? CS42L51_IN_MIC1 :
                                      CS42L51_IN_LINE1;

            /* Initialize the codec internal registers */
            if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Update audio in context state */
              Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
            }
          }
        }
      }
    }
    else /* (Instance == 1U) */
    {
      /* Set SAI instances (SAI1_Block_A needed for MCLK, FS and CLK signals) */
      haudio_in_sai.Instance  = AUDIO_IN_SAI_PDM;

      /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        if (MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
        {
          ret = BSP_ERROR_CLOCK_FAILURE;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspInit(&haudio_in_sai);
#else
        /* Register the default SAI MSP callbacks */
        if (Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
        {
          if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
      }

      if (ret == BSP_ERROR_NONE)
      {
        MX_SAI_Config_t mx_config;

        /* Prepare haudio_in_sai handle */
        mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
        mx_config.AudioMode             = SAI_MODEMASTER_RX;
        mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
        mx_config.MonoStereoMode        = SAI_STEREOMODE;
        mx_config.DataSize              = SAI_DATASIZE_8;
        mx_config.FrameLength           = 16;
        mx_config.ActiveFrameLength     = 1;
        mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
        mx_config.Synchro               = SAI_ASYNCHRONOUS;
        mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
        mx_config.SlotActive            = SAI_SLOTACTIVE_0;

        if (MX_SAI1_Init(&haudio_in_sai, &mx_config) != HAL_OK)
        {
          /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
        /* Register SAI TC, HT and Error callbacks */
        else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback)
                 != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
          if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1U) */

        if (ret == BSP_ERROR_NONE)
        {
          /* Update audio in context state */
          Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
        }
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Deinit the audio IN peripherals.
  * @param  Instance  AUDIO IN Instance. It can be 0 when SAI is used or 1 if SAI PDM is used
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RESET)
  {
    if (Instance == 0U)
    {
      /* Reset audio codec if not currently used by audio out instance 0 */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        (void) CS42L51_PowerDown();
      }

      /* SAI peripheral de-initialization */
      if (HAL_SAI_DeInit(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      /* De-initialize audio codec if not currently used by audio out instance 0 */
      else
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspDeInit(&haudio_in_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          if (Audio_Drv->DeInit(Audio_CompObj) < 0)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Update audio in context */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
      }
    }
    else /* (Instance == 1U) */
    {
      if (HAL_SAI_DeInit(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0U)
        SAI_MspDeInit(&haudio_in_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0U) */

        /* Update BSP AUDIO IN state */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
      }
    }
  }
  else
  {
    /* Nothing to do */
  }


  /* Return BSP status */
  return ret;
}

/**
  * @brief  Start audio recording.
  * @param  Instance  AUDIO IN Instance. It can be 0 (SAI is used)
  * @param  pBuf     Main buffer pointer for the recorded data storing
  * @param  NbrOfBytes  Size of the record buffer
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Record(uint32_t Instance, uint8_t *pBuf, uint32_t NbrOfBytes)
{
  int32_t ret = BSP_ERROR_NONE;

  if ((Instance >= AUDIO_IN_INSTANCES_NBR) || (pBuf == NULL))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Instance == 1U)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_STOP)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    /* If no playback is on going, transmit some bytes on audio out stream to generate SAI clock and synchro signals */
    if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_PLAYING) && (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_PAUSE))
    {
      uint8_t TxData[2] = {0x00U, 0x00U};
      if (HAL_SAI_Transmit(&haudio_out_sai, TxData, 2, 1000) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      /* Call the audio Codec Play function */
      if (Audio_Drv->Play(Audio_CompObj) < 0)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        /* Initiate a DMA transfer of audio samples from the serial audio interface */
        /* Because only 16 bits per sample is supported, DMA transfer is in halfword size */
        if (HAL_SAI_Receive_DMA(&haudio_in_sai, (uint8_t *) pBuf, (uint16_t) NbrOfBytes / 2U) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      /* Update audio in state */
      Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RECORDING;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Stop audio recording.
  * @param  Instance  AUDIO IN Instance. It can be 0 (SAI is used) or 1 (SAI PDM used)
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Stop(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State == AUDIO_IN_STATE_STOP)
  {
    /* Nothing to do */
  }
  else if ((Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RECORDING) &&
           (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_PAUSE))
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    if (Instance == 0U)
    {
      /* Call the Media layer stop function */
      if (Audio_Drv->Stop(Audio_CompObj, CS42L51_PDWN_HW) < 0)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      if (HAL_SAI_DMAStop(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Update BSP AUDIO IN state */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Pause the audio file stream.
  * @param  Instance  AUDIO IN Instance. It can be 0 (SAI is used) or 1 (SAI PDM used)
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Pause(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RECORDING)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    if (Instance == 0U)
    {
      if (Audio_Drv->Pause(Audio_CompObj) < 0)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      /* Pause DMA transfer of audio samples from the serial audio interface */
      if (HAL_SAI_DMAPause(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Update BSP AUDIO IN state */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_PAUSE;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Resume the audio file stream.
  * @param  Instance  AUDIO IN Instance. It can be 0 (SAI is used) or 1 (SAI PDM used)
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_Resume(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_PAUSE)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    if (Instance == 0U)
    {
      if (Audio_Drv->Resume(Audio_CompObj) < 0)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (ret == BSP_ERROR_NONE)
    {
      /* Resume DMA transfer of audio samples from the serial audio interface */
      if (HAL_SAI_DMAResume(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* Update BSP AUDIO IN state */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RECORDING;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Start audio recording.
  * @param  Instance  AUDIO IN SAI PDM Instance. It can be only 1
  * @param  pBuf     Main buffer pointer for the recorded data storing
  * @param  NbrOfBytes  Size of the record buffer
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_RecordPDM(uint32_t Instance, uint8_t *pBuf, uint32_t NbrOfBytes)
{
  int32_t ret = BSP_ERROR_NONE;

