STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
  if (Instance != 1U)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Start the process receive DMA */
    if (HAL_SAI_Receive_DMA(&haudio_in_sai, (uint8_t *)pBuf, (uint16_t)NbrOfBytes) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Update BSP AUDIO IN state */
      Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RECORDING;
    }
  }

  /* Return BSP status */
  return ret;
}


/**
  * @brief  Set Audio In device
  * @param  Instance  AUDIO IN Instance. It can be 0 for SAI, 1 for SAI PDM
  * @param  Device    The audio input device to be used
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_SetDevice(uint32_t Instance, uint32_t Device)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_STOP)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    if ((Instance == 0U) && (Audio_In_Ctx[Instance].Device != Device))
    {
      MX_SAI_Config_t mx_config;

      /* Prepare haudio_in_sai handle */
      mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
      mx_config.AudioMode             = SAI_MODESLAVE_RX;
      mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
      mx_config.MonoStereoMode        = (Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? SAI_MONOMODE : SAI_STEREOMODE;
      mx_config.DataSize              = SAI_DATASIZE_16;
      mx_config.FrameLength           = 32;
      mx_config.ActiveFrameLength     = 16;
      mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
      mx_config.Synchro               = SAI_SYNCHRONOUS;
      mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
      mx_config.SlotActive            = (Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? SAI_SLOTACTIVE_0 :
                                        (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1);

      if (MX_SAI1_Init(&haudio_in_sai, &mx_config) != HAL_OK)
      {
        /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        CS42L51_Init_t codec_init;

        /* Fill codec_init structure */
        codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) ? CS42L51_OUT_NONE :
                                  CS42L51_OUT_HEADPHONE;
        codec_init.Frequency    = Audio_In_Ctx[Instance].SampleRate;
        codec_init.Resolution   = CS42L51_RESOLUTION_16B; /* Not used */
        codec_init.Volume       = Audio_In_Ctx[Instance].Volume;
        codec_init.InputDevice  = (Device == AUDIO_IN_DEVICE_ANALOG_MIC) ? CS42L51_IN_MIC1 : CS42L51_IN_LINE1;

        /* Initialize the codec internal registers */
        if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          /* Update audio in context device */
          Audio_In_Ctx[Instance].Device = Device;
        }
      }
    }
    else
    {
      /* Nothing to do because there is only one device for each instance or device is the same as already used */
    }
  }
  return ret;
}

/**
  * @brief  Get Audio In device
  * @param  Instance  AUDIO IN Instance. It can be 0 for SAI, 1 for SAI PDM
  * @param  Device    The audio input device used
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_GetDevice(uint32_t Instance, uint32_t *Device)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State == AUDIO_IN_STATE_RESET)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    /* Return audio Input Device */
    *Device = Audio_In_Ctx[Instance].Device;
  }
  return ret;
}

/**
  * @brief  Set Audio In frequency
  * @param  Instance    Audio IN instanc. It can be 0 for SAI, 1 for SAI PDM
  * @param  SampleRate  Input frequency to be set
  * @retval BSP status
  */
int32_t BSP_AUDIO_IN_SetSampleRate(uint32_t Instance, uint32_t  SampleRate)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_STOP)
  {
    ret = BSP_ERROR_BUSY;
  }
  /* Check if playback on instance 0 is on going and corresponding sample rate */
  else if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) &&
           (Audio_Out_Ctx[0].SampleRate != SampleRate))
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  /* Check if sample rate is modified */
  else if (Audio_In_Ctx[Instance].SampleRate == SampleRate)
  {
    /* Nothing to do */
  }
  else
  {
    if (Instance == 0U)
    {
      /* Update SAI1 clock config */
      haudio_in_sai.Init.AudioFrequency = SampleRate;
      haudio_out_sai.Init.AudioFrequency = SampleRate;
      if (MX_SAI1_ClockConfig(&haudio_in_sai, SampleRate) != HAL_OK)
      {
        ret = BSP_ERROR_CLOCK_FAILURE;
      }
      /* Re-initialize SAI1 with new sample rate */
      else if (HAL_SAI_Init(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else if (HAL_SAI_Init(&haudio_out_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      /* Store new sample rate on audio in context */
      else
      {
        Audio_In_Ctx[Instance].SampleRate = SampleRate;
      }
    }
    else /* (Instance == 1U) */
    {
      MX_SAI_Config_t mx_config;

      /* Prepare haudio_in_sai handle */
      mx_config.AudioFrequency        = SampleRate;
      mx_config.AudioMode             = SAI_MODEMASTER_RX;
      mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
      mx_config.MonoStereoMode        = SAI_STEREOMODE;
      mx_config.DataSize              = SAI_DATASIZE_8;
      mx_config.FrameLength           = 16;
      mx_config.ActiveFrameLength     = 1;
      mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
      mx_config.Synchro               = SAI_ASYNCHRONOUS;
      mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
      mx_config.SlotActive            = SAI_SLOTACTIVE_0;

