STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
  /* This function is called when an Interrupt due to transfer error on or peripheral
     error occurs. */
}

/**
  * @}
  */

/** @defgroup STM32WBA55G_DK1_AUDIO_IN_Private_Functions AUDIO IN Private Functions
  * @{
  */

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Half reception complete callback.
  * @param  hsai   SAI handle.
  * @retval None
  */
static void SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Call the record update function to get the first half */
  if (hsai->Instance == AUDIO_IN_SAI)
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(0);
  }
  else
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(1);
  }
}

/**
  * @brief  Reception complete callback.
  * @param  hsai   SAI handle.
  * @retval None
  */
static void SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Call the record update function to get the second half */
  if (hsai->Instance == AUDIO_IN_SAI)
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(0);
  }
  else
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(1);
  }
}
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/** @defgroup STM32WBA55G_DK1_AUDIO_Private_Functions AUDIO Private Functions
  * @{
  */

/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t CS42L51_Probe(void)
{
  int32_t                   ret = BSP_ERROR_NONE;
  CS42L51_IO_t              IOCtx;
  static CS42L51_Object_t   CS42L51Obj;
  uint32_t                  cs42l51_id;

  /* Configure the audio driver */
  IOCtx.Address     = AUDIO_I2C_ADDRESS;
  IOCtx.Init        = BSP_I2C3_Init;
  IOCtx.DeInit      = BSP_I2C3_DeInit;
  IOCtx.ReadReg     = BSP_I2C3_ReadReg;
  IOCtx.WriteReg    = BSP_I2C3_WriteReg;
  IOCtx.GetTick     = BSP_GetTick;

  if (CS42L51_RegisterBusIO(&CS42L51Obj, &IOCtx) != CS42L51_OK)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else if (CS42L51_ReadID(&CS42L51Obj, &cs42l51_id) != CS42L51_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (cs42l51_id != (CS42L51_ID | 0x01U))
  {
    ret = BSP_ERROR_UNKNOWN_COMPONENT;
  }
  else
  {
    Audio_Drv = (AUDIO_Drv_t *) &CS42L51_Driver;
    Audio_CompObj = &CS42L51Obj;
  }

  return ret;
}

/**
  * @brief  Un-reset CS42L51.
  * @retval BSP status.
  */
static int32_t CS42L51_PowerUp(void)
{
  GPIO_InitTypeDef  gpio_init_structure;

  AUDIO_NRST_ENABLE();

  /* Configure the CS42L51 reset pin */
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_PULLDOWN;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pin = AUDIO_NRST_PIN;
  HAL_GPIO_Init(AUDIO_NRST_GPIO_PORT, &gpio_init_structure);
  HAL_GPIO_WritePin(AUDIO_NRST_GPIO_PORT, AUDIO_NRST_PIN, GPIO_PIN_SET);

  /* Wait 1ms according CS42L51 datasheet */
  HAL_Delay(1);

  return BSP_ERROR_NONE;
}

/**
  * @brief  Reset CS42L51.
  * @retval BSP status.
  */
static int32_t CS42L51_PowerDown(void)
{
  int32_t ret = BSP_ERROR_NONE;

  HAL_GPIO_DeInit(AUDIO_NRST_GPIO_PORT, AUDIO_NRST_PIN);

  return ret;
}

/**
  * @brief  Initialize BSP_AUDIO_OUT MSP.
  * @param  hsai  SAI handle
  * @retval None
  */
static void SAI_MspInit(SAI_HandleTypeDef *hsai)
{
  GPIO_InitTypeDef  gpio_init_structure;
  static DMA_NodeTypeDef TxNode, RxNode;
  static DMA_NodeConfTypeDef dmaNodeConfig;

  /* Enable SAI clock */
  AUDIO_OUT_SAI_CLK_ENABLE();

  /* Enable GPIO clock */
  AUDIO_OUT_SAI_MCLK_ENABLE();
  AUDIO_OUT_SAI_SCK_ENABLE();
  AUDIO_OUT_SAI_SD_ENABLE();
  AUDIO_OUT_SAI_FS_ENABLE();
  /* CODEC_SAI pins configuration: FS, SCK, MCK and SD pins ------------------*/
  gpio_init_structure.Pin = AUDIO_OUT_SAI_FS_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Alternate = AUDIO_OUT_SAI_FS_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAI_FS_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = AUDIO_OUT_SAI_SCK_PIN;
  gpio_init_structure.Alternate = AUDIO_OUT_SAI_SCK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAI_SCK_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin =  AUDIO_OUT_SAI_SD_PIN;
  gpio_init_structure.Alternate = AUDIO_OUT_SAI_SD_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAI_SD_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = AUDIO_OUT_SAI_MCLK_PIN;
  gpio_init_structure.Alternate = AUDIO_OUT_SAI_MCLK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAI_MCLK_GPIO_PORT, &gpio_init_structure);

  if (hsai->Instance == AUDIO_OUT_SAI)
  {
    /* Configure the hDmaSaiTx handle parameters */
    AUDIO_OUT_SAI_DMA_CLK_ENABLE();

    if (SAITxQueue.Head != NULL)
    {
      /* Reset the DMA Channel configuration*/
      if (HAL_DMAEx_List_DeInit(&hDmaSaiTx) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }

      /* Reset TxQueue */
      if (HAL_DMAEx_List_ResetQ(&SAITxQueue) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }
    }

    /* DMA for Tx */
    /* Set node type */
    dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
    /* Set common node parameters */
    dmaNodeConfig.Init.Request                        = AUDIO_OUT_SAI_DMA_REQUEST;
    dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
    dmaNodeConfig.Init.Direction                      = DMA_MEMORY_TO_PERIPH;
    dmaNodeConfig.Init.SrcInc                         = DMA_SINC_INCREMENTED;
    dmaNodeConfig.Init.DestInc                        = DMA_DINC_FIXED;
    if (Audio_Out_Ctx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
    {
      dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_HALFWORD;
      dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_HALFWORD;
    }
    else /* AUDIO_RESOLUTION_24b */
    {
      dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_WORD;
      dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_WORD;
    }
    dmaNodeConfig.Init.SrcBurstLength                 = 1;
    dmaNodeConfig.Init.DestBurstLength                = 1;
    dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
    dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
    dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
    /* Set node data handling parameters */
    dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
    dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
    /* Set node trigger parameters */
    dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

    /* Build NodeTx */
    if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &TxNode) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

