STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
    /* Insert NodeTx to SAI queue */
    if (HAL_DMAEx_List_InsertNode_Tail(&SAITxQueue, &TxNode) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Set queue circular mode for sai queue */
    if (HAL_DMAEx_List_SetCircularMode(&SAITxQueue) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* DMA for Tx */
    hDmaSaiTx.Instance                         = AUDIO_OUT_SAI_DMA_CHANNEL;

    hDmaSaiTx.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
    hDmaSaiTx.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
    hDmaSaiTx.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
    hDmaSaiTx.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
    hDmaSaiTx.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

    /* DMA linked list init */
    if (HAL_DMAEx_List_Init(&hDmaSaiTx) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Link SAI queue to DMA channel */
    if (HAL_DMAEx_List_LinkQ(&hDmaSaiTx, &SAITxQueue) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsai, hdmatx, hDmaSaiTx);

    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(AUDIO_OUT_SAI_DMA_IRQ, BSP_AUDIO_OUT_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(AUDIO_OUT_SAI_DMA_IRQ);

  }

  /* Audio In Msp initialization */
  if (hsai->Instance == AUDIO_IN_SAI)
  {
    if (Audio_In_Ctx[0U].State == AUDIO_IN_STATE_INIT) /* SAI interface */
    {
      /* Enable SAI clock */
      AUDIO_IN_SAI_CLK_ENABLE();

      /* Enable SD GPIO clock */
      AUDIO_IN_SAI_SD_ENABLE();
      /* CODEC_SAI pin configuration: SD pin */
      gpio_init_structure.Pin = AUDIO_IN_SAI_SD_PIN;
      gpio_init_structure.Mode = GPIO_MODE_AF_PP;
      gpio_init_structure.Pull = GPIO_NOPULL;
      gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init_structure.Alternate = AUDIO_IN_SAI_AF;
      HAL_GPIO_Init(AUDIO_IN_SAI_SD_GPIO_PORT, &gpio_init_structure);

      /* Enable the DMA clock */
      AUDIO_IN_SAI_DMA_CLK_ENABLE();

      if (SAIRxQueue.Head != NULL)
      {
        /* Reset the DMA Channel configuration*/
        if (HAL_DMAEx_List_DeInit(&hDmaSaiRx) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(0);
        }

        /* Reset RxQueue */
        if (HAL_DMAEx_List_ResetQ(&SAIRxQueue) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(0);
        }
      }

      /* DMA for Rx */
      /* Set node type */
      dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
      /* Set common node parameters */
      dmaNodeConfig.Init.Request                        = AUDIO_IN_SAI_DMA_REQUEST;
      dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
      dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
      dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
      dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
      if (Audio_In_Ctx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_HALFWORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_HALFWORD;
      }
      else /* AUDIO_RESOLUTION_24b */
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_WORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_WORD;
      }
      dmaNodeConfig.Init.SrcBurstLength                 = 1;
      dmaNodeConfig.Init.DestBurstLength                = 1;
      dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
      dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
      dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
      /* Set node data handling parameters */
      dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
      dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
      /* Set node trigger parameters */
      dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

      /* Build NodeRx */
      if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Insert NodeTx to SAI queue */
      if (HAL_DMAEx_List_InsertNode_Tail(&SAIRxQueue, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Set queue circular mode for sai queue */
      if (HAL_DMAEx_List_SetCircularMode(&SAIRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* DMA for Rx */
      hDmaSaiRx.Instance                         = AUDIO_IN_SAI_DMA_CHANNEL;

      hDmaSaiRx.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
      hDmaSaiRx.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
      hDmaSaiRx.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
      hDmaSaiRx.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
      hDmaSaiRx.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

      /* DMA linked list init */
      if (HAL_DMAEx_List_Init(&hDmaSaiRx) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Link SAI queue to DMA channel */
      if (HAL_DMAEx_List_LinkQ(&hDmaSaiRx, &SAIRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Associate the DMA handle */
      __HAL_LINKDMA(hsai, hdmarx, hDmaSaiRx);

      /* SAI DMA IRQ Channel configuration */
      HAL_NVIC_SetPriority(AUDIO_IN_SAI_DMA_IRQ, BSP_AUDIO_IN_IT_PRIORITY, 0);
      HAL_NVIC_EnableIRQ(AUDIO_IN_SAI_DMA_IRQ);
    }
    else /* PDM interface */
    {
      /* Enable SAI clock */
      AUDIO_IN_SAI_PDM_CLK_ENABLE();

      AUDIO_IN_SAI_PDM_CLK_IN_ENABLE();
      AUDIO_IN_SAI_PDM_DATA_IN_ENABLE();

      gpio_init_structure.Pin = AUDIO_IN_SAI_PDM_CLK_IN_PIN;
      gpio_init_structure.Mode = GPIO_MODE_AF_PP;
      gpio_init_structure.Pull = GPIO_NOPULL;
      gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init_structure.Alternate = AUDIO_IN_SAI_PDM_DATA_CLK_AF;
      HAL_GPIO_Init(AUDIO_IN_SAI_PDM_CLK_IN_PORT, &gpio_init_structure);

      gpio_init_structure.Pin = AUDIO_IN_SAI_PDM_DATA_IN_PIN;
      HAL_GPIO_Init(AUDIO_IN_SAI_PDM_DATA_IN_PORT, &gpio_init_structure);

      /* Enable the DMA clock */
      AUDIO_IN_SAI_PDM_DMA_CLK_ENABLE();

      if (SAIRxQueue.Head == NULL)
      {
        /* DMA for Rx */
        /* Set node type */
        dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
        /* Set common node parameters */
        dmaNodeConfig.Init.Request                        = AUDIO_IN_SAI_PDM_DMA_REQUEST;
        dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
        dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
        dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
        dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
        dmaNodeConfig.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_BYTE;
        dmaNodeConfig.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_BYTE;
        dmaNodeConfig.Init.SrcBurstLength                 = 1;
        dmaNodeConfig.Init.DestBurstLength                = 1;
        dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
        dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
        dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
        /* Set node data handling parameters */
        dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
        dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
        /* Set node trigger parameters */
        dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

        /* Build NodeRx */
        if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(1);
        }

