STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA55G-DK1/stm32wba55g_discovery_audio.c
        /* Insert NodeTx to SAI queue */
        if (HAL_DMAEx_List_InsertNode_Tail(&SAIRxQueue, &RxNode) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(1);
        }

        /* Set queue circular mode for sai queue */
        if (HAL_DMAEx_List_SetCircularMode(&SAIRxQueue) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(1);
        }
      }

      /* DMA for Rx */
      hDmaSaiRx.Instance                         = AUDIO_IN_SAI_PDM_DMA_CHANNEL;

      hDmaSaiRx.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
      hDmaSaiRx.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
      hDmaSaiRx.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
      hDmaSaiRx.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
      hDmaSaiRx.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

      /* DMA linked list init */
      if (HAL_DMAEx_List_Init(&hDmaSaiRx) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }

      /* Link SAI queue to DMA channel */
      if (HAL_DMAEx_List_LinkQ(&hDmaSaiRx, &SAIRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }

      /* Associate the DMA handle */
      __HAL_LINKDMA(hsai, hdmarx, hDmaSaiRx);

      /* SAI DMA IRQ Channel configuration */
      HAL_NVIC_SetPriority(AUDIO_IN_SAI_PDM_DMA_IRQ, BSP_AUDIO_IN_IT_PRIORITY, 0);
      HAL_NVIC_EnableIRQ(AUDIO_IN_SAI_PDM_DMA_IRQ);
    }
  }
}

/**
  * @brief  Deinitializes SAI MSP.
  * @param  hsai  SAI handle
  * @retval HAL status
  */
static void SAI_MspDeInit(SAI_HandleTypeDef *hsai)
{
  if (hsai->Instance == AUDIO_OUT_SAI)
  {
    /* Disable SAI DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(AUDIO_OUT_SAI_DMA_IRQ);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&hDmaSaiTx) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Reset TxQueue */
    if (HAL_DMAEx_List_ResetQ(&SAITxQueue) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* De-initialize FS, SCK, MCK and SD pins */
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_FS_GPIO_PORT, AUDIO_OUT_SAI_FS_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_SCK_GPIO_PORT, AUDIO_OUT_SAI_SCK_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_SD_GPIO_PORT, AUDIO_OUT_SAI_SD_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_MCLK_GPIO_PORT, AUDIO_OUT_SAI_MCLK_PIN);
  }
  if (hsai->Instance == AUDIO_IN_SAI)
  {
    if (Audio_In_Ctx[0U].State != AUDIO_IN_STATE_RESET) /* SAI interface */
    {
      /* Disable SAI DMA Channel IRQ */
      HAL_NVIC_DisableIRQ(AUDIO_IN_SAI_DMA_IRQ);

      /* Reset the DMA Channel configuration*/
      if (HAL_DMAEx_List_DeInit(&hDmaSaiRx) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Reset RxQueue */
      if (HAL_DMAEx_List_ResetQ(&SAIRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* De-initialize SD pin */
      HAL_GPIO_DeInit(AUDIO_IN_SAI_SD_GPIO_PORT, AUDIO_IN_SAI_SD_PIN);

      /* Disable SAI clock */
      AUDIO_IN_SAI_CLK_DISABLE();
    }
    else /* PDM interface */
    {
      /* Disable SAI DMA Channel IRQ */
      HAL_NVIC_DisableIRQ(AUDIO_IN_SAI_PDM_DMA_IRQ);

      /* Reset the DMA Channel configuration*/
      if (HAL_DMAEx_List_DeInit(&hDmaSaiRx) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }

      /* Reset RxQueue */
      if (HAL_DMAEx_List_ResetQ(&SAIRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }

      /* De-initialize SD pin */
      HAL_GPIO_DeInit(AUDIO_IN_SAI_PDM_DATA_IN_PORT, AUDIO_IN_SAI_PDM_DATA_IN_PIN);
      HAL_GPIO_DeInit(AUDIO_IN_SAI_PDM_CLK_IN_PORT, AUDIO_IN_SAI_PDM_CLK_IN_PIN);

      /* Disable SAI clock */
      AUDIO_IN_SAI_PDM_CLK_DISABLE();
    }
  }
}


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


